app/controllers/clientes_controller.rb

INSERT INTO "clientes" ("nome", "data_nascimento", "telefone", "celular", "email", "comentarios", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    if current_user.perfil_id == 1 || current_user.perfil_id == 2
      @cliente = Cliente.new(cliente_params)

      respond_to do |format|
        if @cliente.save