app/controllers/especialidades_controller.rb

INSERT INTO "especialidades" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Cabeleireiro"], ["created_at", "2016-01-15 17:52:20.006553"], ["updated_at", "2016-01-15 17:52:20.006553"]]
---
  def create
    @especialidade = Especialidade.new(espec_params)
    flash[:notice] = 'Especialidade criada.' if current_user.perfil_id != 3 && @especialidade.save

SELECT  "especialidades".* FROM "especialidades" WHERE "especialidades"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_especialidade
    @especialidade = Especialidade.find(params[:id])