app/controllers/reservas_controller.rb

SELECT "reservas".* FROM "reservas" WHERE (strftime('%m/%Y', data) = '01/2016')  ORDER BY hora ASC
---
  def index
    @reservas = Reserva.all

INSERT INTO "reservas" ("cliente_id", "servico_id", "profissional_id", "preco", "data", "hora", "comentarios", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @reserva = Reserva.new(reserva_params)

    respond_to do |format|
      if @reserva.save

UPDATE "reservas" SET "data" = ?, "hora" = ?, "updated_at" = ? WHERE "reservas"."id" = ?  [["data", "2016-01-16"], ["hora", "2000-01-01 11:00:00.000000"], ["updated_at", "2016-01-15 18:07:22.981751"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @reserva.update(reserva_params)

SELECT  "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_reserva
      @reserva = Reserva.find(params[:id])