app/controllers/servicos_controller.rb

  def create
    if current_user.perfil_id == 1
      @servico = Servico.new(servico_params)
      respond_to do |format|
        if @servico.save
---
INSERT INTO "servicos" ("nome", "especialidade_id", "tempo_estimado", "preco", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def set_servico
    @servico = Servico.find(params[:id])
---
SELECT  "servicos".* FROM "servicos" WHERE "servicos"."id" = ? LIMIT 1  [["id", 1]]